schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
#if defined(ENABLE_KELLY)
// Decoded Kelly monitor block. Field offsets and raw semantics mirror
// kelly/solectrac-kelly-monitor.py Monitor.decode (offsets 0..21 defined; the
// rest of the 48-byte block is unknown). Values are kept raw, no scaling, to
// match the Python decode — see kelly/README.md for what's CONFIRMED vs
// TENTATIVE. `valid`/`last_seen_ms` drive JSON freshness like the CAN states.
struct KellyState {
    uint8_t  tps_pedal         = 0;
    uint8_t  b_plus_v          = 0;   // battery volts (raw byte)
    int16_t  motor_temp_c      = 0;
    int16_t  controller_temp_c = 0;
    uint8_t  forward_switch    = 0;
    uint8_t  low_speed         = 0;   // 1 = low setpoint (~2400), 0 = high (~2800)
    uint16_t error_status      = 0;   // 16-bit fault bitmask (bit -> KELLY_ERROR_NAMES)
    uint16_t motor_speed_rpm   = 0;
    uint16_t phase_current_a   = 0;
    bool     valid             = false;
    uint32_t last_seen_ms      = 0;
};
#endif

// ── Global state ──────────────────────────────────────────────────────────────
// All updated from the CAN decode path inside loop(), read when building JSON
// from the same thread — no locking needed.

float       g_cell_v[NUM_CELLS];
float       g_temp_c[NUM_TEMPS];
PackState   g_pack;
BmsStateFlags g_bms_state;
BmsLimits   g_bms_limit;
BmsFaults   g_bms_faults;
MotorState  g_motor;
ChargerState g_charger;
ChgrCmdState g_chgr_cmd;
#if defined(ENABLE_KELLY)
KellyState  g_kelly;   // updated by kellyPoll() in loop(), read when building JSON
#endif
uint8_t     g_vc_state   = 0xFF;   // 0xFF = never seen
uint8_t     g_dash_alive = 0xFF;
Dm1State    g_dm1;

// CAN bus health counters
uint32_t    g_frames_rx      = 0;   // total frames received
uint32_t    g_frames_decoded = 0;   // frames matching a known PGN/source
uint32_t    g_last_frame_ms  = 0;   // millis() at last received frame
uint32_t    g_can_recoveries = 0;   // bus-off recoveries initiated since boot
uint32_t    g_socketcand_tx_dropped = 0;   // frames dropped on full client TCP buffers
bool        g_can_initialized = false;
bool        g_ap_running      = false;

#if defined(HAS_MCP2515)
bool        g_mcp_initialized = false;
uint32_t    g_mcp_init_err    = 0xFFFFFFFFUL;   // sentinel: never attempted
uint32_t    g_mcp_frames_rx   = 0;
// MCP2515: external classic-CAN 2.0B controller wired to SPI, run at 250 kbit/s
// to match the J1939 main bus. The library's RX buffers are drained from
// loop(); frames are forwarded to socketcand as channel can1. Crystal frequency
// is board-dependent — see MCP2515_QUARTZ_HZ if can1 stays silent.
static ACAN2515 g_mcp(MCP2515_CS_PIN, SPI, MCP2515_INT_PIN);
#endif

#if defined(HAS_VIN_SENSE)
float       g_vin_v = NAN;   // most recent 12 V supply reading, averaged
#endif

// Session energy tracking (integrated power since boot)
uint32_t    g_session_last_ms   = 0;
uint32_t    g_session_active_ms = 0;   // sum of valid dt's — excludes bus-silent gaps
float       g_session_wh_drawn  = 0.0f;
float       g_session_wh_charged = 0.0f;
// First BMS-published SOC seen this session; current - start = session ΔSOC.
float       g_session_soc_start_pct = NAN;

WebServer server(80);
DNSServer  dns_server;

// Dashboard HTML, embedded at build time via board_build.embed_txtfiles in
// platformio.ini. The linker generates these symbols from the file path:
// src/dashboard.html → _binary_src_dashboard_html_{start,end}. The data is
// null-terminated (embed_txtfiles), so the start pointer is usable as a
// C-string for server.send_P().
extern const uint8_t dashboard_html_start[] asm("_binary_src_dashboard_html_start");
extern const uint8_t dashboard_html_end[]   asm("_binary_src_dashboard_html_end");

// ── LED status indicator ──────────────────────────────────────────────────────
// Single-LED boards (Adafruit Feather S3 NeoPixel) colour-code state on one
// pixel:
//   Red blink     — CAN driver failed to initialize
//   Amber blink   — No Wi-Fi up at all (AP failed and STA not connected)
//   Dim white     — Alive, no CAN frames received recently
//   Green blink   — CAN frames arriving (toggles on bus activity)
//
// Dual-LED boards (RejsaCAN-ESP32-S3) split the state across two pins:
//   Yellow fast blink — CAN driver failed to initialize
//   Yellow slow blink — No Wi-Fi
//   Yellow off        — Network OK
//   Blue blink        — CAN frames arriving
//   Blue off          — No frames recently (green power LED still shows alive)
//
// On boards without any user LED (LilyGo T-2CAN), the calls are no-ops.

#define LED_BLINK_MS         50
#define LED_ACTIVE_MS        200
#define WARN_BLINK_FAST_MS   100   // CAN init failed
#define WARN_BLINK_SLOW_MS   500   // no WiFi

static uint32_t g_led_last_toggle = 0;
static bool     g_led_on = false;

static inline void ledInit() {
#if LED_IS_NEOPIXEL
    pinMode(LED_POWER_PIN, OUTPUT);
    digitalWrite(LED_POWER_PIN, HIGH);   // enable NeoPixel power rail
#elif LED_IS_DUAL_GPIO
    pinMode(WARN_LED_PIN, OUTPUT);
    pinMode(ACTIVITY_LED_PIN, OUTPUT);
    digitalWrite(WARN_LED_PIN, LOW);
    digitalWrite(ACTIVITY_LED_PIN, LOW);
#endif
}

static inline void ledWrite(uint8_t r, uint8_t g, uint8_t b) {
#if LED_IS_NEOPIXEL
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    rgbLedWrite(LED_PIN, r, g, b);
  #else
    neopixelWrite(LED_PIN, r, g, b);
  #endif
#else
    // Dual-GPIO and no-LED boards: updateLed() drives the pins directly (dual)
    // or there's nothing to drive (none).
    (void)r; (void)g; (void)b;
#endif
}

void updateLed() {
#if LED_IS_DUAL_GPIO
    uint32_t now = millis();

    // Yellow warning channel. Off when healthy; periods chosen so the two
    // failure modes are distinguishable at a glance.
    uint32_t warn_period_ms = 0;
    if (!g_can_initialized) {
        warn_period_ms = WARN_BLINK_FAST_MS;
    } else if (!g_ap_running && WiFi.status() != WL_CONNECTED) {
        warn_period_ms = WARN_BLINK_SLOW_MS;
    }
    static uint32_t warn_last_toggle = 0;
    static bool     warn_on = false;
    if (warn_period_ms > 0) {
        if (now - warn_last_toggle >= warn_period_ms) {
            warn_last_toggle = now;
            warn_on = !warn_on;
        }
        digitalWrite(WARN_LED_PIN, warn_on ? HIGH : LOW);
    } else {
        digitalWrite(WARN_LED_PIN, LOW);
        warn_on = false;
    }

    // Blue activity channel. The board's green power LED already signals
    // "alive", so blue stays off until bus traffic appears.
    bool active = (g_frames_rx > 0) && (now - g_last_frame_ms < LED_ACTIVE_MS);
    static uint32_t act_last_toggle = 0;
    static bool     act_on = false;
    if (active) {
        if (now - act_last_toggle >= LED_BLINK_MS) {
            act_last_toggle = now;
            act_on = !act_on;
        }
        digitalWrite(ACTIVITY_LED_PIN, act_on ? HIGH : LOW);
    } else {
        digitalWrite(ACTIVITY_LED_PIN, LOW);
        act_on = false;
    }
    return;
#else
    uint32_t now = millis();
    bool toggle = (now - g_led_last_toggle) >= LED_BLINK_MS;

