schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
// Advance the poll state machine by one loop() tick. Sends one monitor query,
// accumulates its reply across ticks, and on the third good reply decodes the
// block. A per-command timeout aborts the cycle and lets g_kelly go stale.
void kellyPoll() {
    static enum { KIDLE, KWAIT } state = KIDLE;
    static uint8_t  block[48];
    static uint8_t  rxbuf[32];
    static uint8_t  rxlen     = 0;
    static uint8_t  cmd_index = 0;
    static uint32_t cycle_ms  = 0;   // last cycle start
    static uint32_t cmd_ms    = 0;   // current query send time

    uint32_t now = millis();

    if (state == KIDLE) {
        if (now - cycle_ms < KELLY_POLL_INTERVAL_MS) return;
        cycle_ms  = now;
        cmd_index = 0;
        rxlen     = 0;
        while (Serial1.available()) Serial1.read();   // drop stale bytes
        kellySendQuery(KELLY_MON_CMDS[0]);
        cmd_ms = now;
        state  = KWAIT;
        return;
    }

    // KWAIT: gather this command's reply, resync on [CMD, 0x10, <16>, CHK].
    uint8_t cmd = KELLY_MON_CMDS[cmd_index];
    while (Serial1.available() && rxlen < sizeof(rxbuf)) {
        rxbuf[rxlen++] = (uint8_t)Serial1.read();
    }
    for (int i = 0; i + 19 <= rxlen; i++) {
        if (rxbuf[i] != cmd || rxbuf[i + 1] != 0x10) continue;
        uint16_t sum = cmd + 0x10;
        for (int j = 0; j < 16; j++) sum += rxbuf[i + 2 + j];
        if ((sum & 0xFF) != rxbuf[i + 18]) continue;
        memcpy(&block[cmd_index * 16], &rxbuf[i + 2], 16);
        rxlen = 0;
        if (++cmd_index >= 3) {
            kellyDecodeBlock(block);
            state = KIDLE;
            return;
        }
        kellySendQuery(KELLY_MON_CMDS[cmd_index]);
        cmd_ms = now;
        return;
    }
    if (now - cmd_ms > KELLY_CMD_TIMEOUT_MS) state = KIDLE;   // give up this cycle
}
#endif  // ENABLE_KELLY

// ── JSON builder ──────────────────────────────────────────────────────────────

static void addFloat(JsonObject& obj, const char* key, float v, int decimals = 2) {
    if (!isnan(v)) {
        float factor = 1.0f;
        for (int i = 0; i < decimals; i++) factor *= 10.0f;
        obj[key] = roundf(v * factor) / factor;
    }
}

// `minimal` strips fields the HTML dashboard doesn't render — used to cut BLE
// payload size. The full set is still served at /json. Note the per-cell
// voltage/temperature arrays are NOT stripped: the cell-detail view renders
// them over BLE too.
String buildJson(bool pretty = true, bool minimal = false) {
    JsonDocument doc;

    doc["uptime"] = millis() / 1000.0;
#ifdef GIT_SHA
    doc["version"] = GIT_SHA;
#endif

    // CAN bus health
    auto can = doc["can"].to<JsonObject>();
    if (!g_can_initialized) {
        can["state"] = "not_initialized";
    } else {
        twai_status_info_t si;
        if (twai_get_status_info(&si) == ESP_OK) {
            switch (si.state) {
                case TWAI_STATE_STOPPED:    can["state"] = "stopped";    break;
                case TWAI_STATE_RUNNING:    can["state"] = "running";    break;
                case TWAI_STATE_BUS_OFF:    can["state"] = "bus_off";    break;
                case TWAI_STATE_RECOVERING: can["state"] = "recovering"; break;
                default:                    can["state"] = "unknown";    break;
            }
            if (!minimal) {
                can["tec"]        = si.tx_error_counter;
                can["rec"]        = si.rx_error_counter;
                can["rx_missed"]  = si.rx_missed_count;
                can["bus_errors"] = si.bus_error_count;
                can["bus_recoveries"] = g_can_recoveries;
            }
        }
    }
    can["frames_rx"]      = g_frames_rx;
    if (!minimal) can["mode"] = CAN_TX_ENABLED ? "normal" : "listen_only";
    if (!minimal) can["frames_decoded"] = g_frames_decoded;
    if (!minimal && g_socketcand_tx_dropped)
        can["socketcand_dropped"] = g_socketcand_tx_dropped;
    if (g_frames_rx > 0)
        can["last_frame_age_s"] = (millis() - g_last_frame_ms) / 1000.0;
#if defined(HAS_MCP2515)
    auto mcp = can["mcp2515"].to<JsonObject>();
    mcp["initialized"] = g_mcp_initialized;
    mcp["init_err"]    = g_mcp_init_err;
    mcp["frames_rx"]   = g_mcp_frames_rx;
    if (!minimal && g_mcp_initialized) {
        // Error-state visibility for can1, matching can0's tec/rec above.
        // Each accessor is one short SPI register read. eflg is the raw EFLG
        // register: bit 5 TXBO (bus-off), bits 4/3 TXEP/RXEP (error-passive),
        // bits 7/6 RX1OVR/RX0OVR (RX buffer overflow).
        mcp["tec"]  = g_mcp.transmitErrorCounter();
        mcp["rec"]  = g_mcp.receiveErrorCounter();
        mcp["eflg"] = g_mcp.errorFlagRegister();
    }
#endif

    // Pack
    auto pack = doc["pack"].to<JsonObject>();
    addFloat(pack, "voltage_v",    g_pack.voltage_v, 2);
    addFloat(pack, "current_a",    g_pack.current_a, 1);
    if (!minimal && g_pack.current_raw >= 0) pack["current_raw"] = g_pack.current_raw;
    addFloat(pack, "power_w",      g_pack.power_w,   1);
    if (!minimal && g_pack.soc_raw) pack["soc_raw"] = g_pack.soc_raw;
    addFloat(pack, "soc_pct",      g_pack.soc_pct,   1);
    if (!minimal) addFloat(pack, "v_estimate", g_pack.v_estimate, 3);
    auto cells_obj = pack["cells"].to<JsonObject>();
    if (g_pack.cell_max_mv >= 0)   cells_obj["max_mv"]    = g_pack.cell_max_mv;
    if (g_pack.cell_min_mv >= 0)   cells_obj["min_mv"]    = g_pack.cell_min_mv;
    if (g_pack.cell_spread_mv >= 0)cells_obj["spread_mv"] = g_pack.cell_spread_mv;
    if (g_pack.cell_max_n)         cells_obj["max_n"]     = g_pack.cell_max_n;
    if (g_pack.cell_min_n)         cells_obj["min_n"]     = g_pack.cell_min_n;
    if (!minimal && g_pack.cell_spread_mv_reported >= 0)
        cells_obj["spread_mv_reported"] = g_pack.cell_spread_mv_reported;
    auto temp = cells_obj["temp_summary"].to<JsonObject>();
    if (g_pack.temp_max_c != INT8_MIN) temp["max_c"]    = g_pack.temp_max_c;
    if (g_pack.temp_min_c != INT8_MIN) temp["min_c"]    = g_pack.temp_min_c;
    if (!minimal) {
        if (g_pack.temp_max_n)             temp["max_n"]    = g_pack.temp_max_n;
        if (g_pack.temp_min_n)             temp["min_n"]    = g_pack.temp_min_n;
        if (g_pack.temp_spread_c >= 0)     temp["spread_c"] = g_pack.temp_spread_c;
    }

    // Session energy summary.
    // Convention: positive = into pack (net charge), negative = out (net draw).
    auto sess = doc["session"].to<JsonObject>();
    sess["wh_drawn"]   = roundf(g_session_wh_drawn   * 10.0f) / 10.0f;
    sess["wh_charged"] = roundf(g_session_wh_charged * 10.0f) / 10.0f;
    sess["wh_net"]     = roundf((g_session_wh_charged - g_session_wh_drawn) * 10.0f) / 10.0f;
    sess["wh_capacity"] = PACK_CAPACITY_WH;
    if (!isnan(g_session_soc_start_pct))
        sess["soc_start_pct"] = roundf(g_session_soc_start_pct * 10.0f) / 10.0f;

    // Session-average net power. Positive = net charging, negative = net drawing.
    // Uses *active* time (sum of valid dt's), so bus-silent gaps don't dilute it.
    float avg_power_w = NAN;
    float active_hours = g_session_active_ms / 3600000.0f;
    if (active_hours > 0.01f) {                            // ≥ ~36 s of data
        avg_power_w = (g_session_wh_charged - g_session_wh_drawn) / active_hours;
        if (!minimal) {
            sess["avg_power_w"] = roundf(avg_power_w * 10.0f) / 10.0f;
            sess["active_s"]    = g_session_active_ms / 1000;
        }
    }

    if (!isnan(g_pack.soc_pct)) {
        float remaining = g_pack.soc_pct * PACK_CAPACITY_WH / 100.0f;
        sess["wh_remaining"] = roundf(remaining * 10.0f) / 10.0f;
        // ETAs use session-average power so they don't jump with instantaneous load
        if (!isnan(avg_power_w)) {
            if (avg_power_w < -50.0f) {
                // Net drawing — extrapolate to empty.
                sess["eta_to_zero_s"] = (uint32_t)(remaining / -avg_power_w * 3600.0f);
            } else if (avg_power_w > 50.0f) {
                // Net charging — extrapolate to full.
                float headroom = PACK_CAPACITY_WH - remaining;
                if (headroom > 0)
                    sess["eta_to_full_s"] = (uint32_t)(headroom / avg_power_w * 3600.0f);
            }
        }
    }

